{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 25,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Connection aux API et à la bdd neo4j\n",
      "Authentification à l'api twitter réussie\n",
      "Connexion à neo4j réussie\n",
      "Authentification à l'api plotly réussie\n",
      "Merci de vérifier que vous avez les modules pythons correctement installés. faire notamment attention à la librairie nltk à installer avec un nltk.download()\n"
     ]
    }
   ],
   "source": [
    "#Connection aux API et à la bdd neo4j\n",
    "print('Connection aux API et à la bdd neo4j')\n",
    "%run ../authentification.ipynb\n",
    "\n",
    "#Importation librairies plotly\n",
    "import plotly.plotly as py\n",
    "import plotly.graph_objs as go\n",
    "\n",
    "#Importation librairies pandas\n",
    "from pandas import DataFrame\n",
    "import pandas as pd\n",
    "import pandas_datareader.data as web\n",
    "\n",
    "#Importation librairies matplotlib\n",
    "import matplotlib.pyplot as plt\n",
    "\n",
    "#Importation librairies textblob\n",
    "from textblob import TextBlob\n",
    "\n",
    "#Autres\n",
    "import re\n",
    "from datetime import datetime\n",
    "\n",
    "\n",
    "import operator \n",
    "import json\n",
    "from collections import Counter\n",
    "import re\n",
    "import nltk\n",
    "#######  TRES IMPORTANT: decommenter la ligne ci dessous et download corpora nltk ############\n",
    "# nltk.download()\n",
    "from nltk.corpus import stopwords\n",
    "import string\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 26,
   "metadata": {},
   "outputs": [],
   "source": [
    "#Methode de Sentiment Analysis\n",
    "def clean_tweet(tweet):\n",
    "    '''\n",
    "    Utility function to clean the text in a tweet by removing \n",
    "    links and special characters using regex.\n",
    "    '''\n",
    "    return ' '.join(re.sub(\"(@[A-Za-z0-9]+)|([^0-9A-Za-z \\t])|(\\w+:\\/\\/\\S+)\", \" \", tweet).split())\n",
    "\n",
    "def analize_sentiment(tweet):\n",
    "    '''\n",
    "    Utility function to classify the polarity of a tweet\n",
    "    using textblob.\n",
    "    '''\n",
    "    analysis = TextBlob(clean_tweet(tweet))\n",
    "    return analysis.sentiment.polarity*10\n",
    "\n",
    "\n",
    "\n",
    "numbers=[]\n",
    "\n",
    "i=0\n",
    "while i <= 2018: # Tant que i est strictement inférieure à 10\n",
    "    numbers.append(str(i))\n",
    "    i += 1\n",
    "#Methodes pour le comptage des occurences des mots\n",
    "alphabet= list(string.ascii_lowercase)\n",
    "punctuation = list(string.punctuation)\n",
    "stop = stopwords.words('english') + punctuation + ['httpstcod','korean','httpstcos', 'donald','jong','america','american','north','korea',\n",
    "                                                   'httpstcob','trumpkim','northkorea',\n",
    "                                                   'trumps','donald','singapore','donaldtrump',\n",
    "                                                   'jongun','jong','un','north','korea','america',\n",
    "                                                   'rt', 'via','i','the','amp','realdonaldtrump','httpstco',\n",
    "                                                   'trump','kim','trumpkimsummit','meeting','summit',\n",
    "                                                   'singaporemeeting', 'kimjongun','donaldtrump','us', \n",
    "                                                   'httpstcoku','03'] +list(numbers) + alphabet\n",
    "\n",
    "emoticons_str = r\"\"\"\n",
    "    (?:\n",
    "        [:=;] # Eyes\n",
    "        [oO\\-]? # Nose (optional)\n",
    "        [D\\)\\]\\(\\]/\\\\OpP] # Mouth\n",
    "    )\"\"\"\n",
    " \n",
    "regex_str = [\n",
    "    emoticons_str,\n",
    "    r'<[^>]+>', # HTML tags\n",
    "    r'(?:@[\\w_]+)', # @-mentions\n",
    "    r\"(?:\\#+[\\w_]+[\\w\\'_\\-]*[\\w_]+)\", # hash-tags\n",
    "    r'http[s]?://(?:[a-z]|[0-9]|[$-_@.&amp;+]|[!*\\(\\),]|(?:%[0-9a-f][0-9a-f]))+', # URLs\n",
    " \n",
    "    r'(?:(?:\\d+,?)+(?:\\.?\\d+)?)', # numbers\n",
    "    r\"(?:[a-z][a-z'\\-_]+[a-z])\", # words with - and '\n",
    "    r'(?:[\\w_]+)', # other words\n",
    "    r'(?:\\S)' # anything else\n",
    "]\n",
    "    \n",
    "tokens_re = re.compile(r'('+'|'.join(regex_str)+')', re.VERBOSE | re.IGNORECASE)\n",
    "emoticon_re = re.compile(r'^'+emoticons_str+'$', re.VERBOSE | re.IGNORECASE)\n",
    " \n",
    "def tokenize(s):\n",
    "    return tokens_re.findall(s)\n",
    "\n",
    "def preprocess(s, lowercase=False):\n",
    "    tokens = tokenize(s)\n",
    "    if lowercase:\n",
    "        tokens = [token if emoticon_re.search(token) else token.lower() for token in tokens]\n",
    "    return tokens\n",
    "\n",
    "\n",
    "\n",
    "\n",
    "\n",
    "\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 50,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<h1>Analyse de la tendance générale</h1>\n",
       "<h3 style=\"color:purple;\" >1) 20 Hashtags les plus utilisés dans les tweets collectés</h3>\n",
       "<p>Par choix, nous avons limité les hashtags ne contenant pas les mots clés suivants:</p>\n",
       "    <UL>\n",
       "        <LI>Trump</LI>\n",
       "        <LI>Kim</LI>\n",
       "        <LI>Summit</LI>\n",
       "        <LI>Trumpkim</LI>\n",
       "        <LI>TrumpKimSummit</LI>\n",
       "        <LI>TrumpKimMeeting</LI>\n",
       "        <LI>SingaporeMeeting</LI>\n",
       "        <LI>SingaporeSummit</LI>\n",
       "        <LI>...</LI>\n",
       "    </UL>"
      ],
      "text/plain": [
       "<IPython.core.display.HTML object>"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "%%HTML\n",
    "<h1>Analyse de la tendance générale</h1>\n",
    "<h3 style=\"color:purple;\" >1) 20 Hashtags les plus utilisés dans les tweets collectés</h3>\n",
    "<p>Par choix, nous avons limité les hashtags ne contenant pas les mots clés suivants:</p>\n",
    "    <UL>\n",
    "        <LI>Trump</LI>\n",
    "        <LI>Kim</LI>\n",
    "        <LI>Summit</LI>\n",
    "        <LI>Trumpkim</LI>\n",
    "        <LI>TrumpKimSummit</LI>\n",
    "        <LI>TrumpKimMeeting</LI>\n",
    "        <LI>SingaporeMeeting</LI>\n",
    "        <LI>SingaporeSummit</LI>\n",
    "        <LI>...</LI>\n",
    "    </UL>"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 28,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<iframe id=\"igraph\" scrolling=\"no\" style=\"border:none;\" seamless=\"seamless\" src=\"https://plot.ly/~Noiram/10.embed\" height=\"525px\" width=\"100%\"></iframe>"
      ],
      "text/plain": [
       "<plotly.tools.PlotlyDisplay object>"
      ]
     },
     "execution_count": 28,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "queryImportantPeople='MATCH (t:Tweet)-[re:HAS]->(h:Hashtag) WHERE NOT ((lower(h.tag) = \"trump\") OR (lower(h.tag)=\"trumpkim\") OR (lower(h.tag)=\"trumpkimsummit\") OR (lower(h.tag)=\"kim\") OR (lower(h.tag)=\"trumpkimmeeting\") OR (lower(h.tag)=\"singaporesummit\") OR (lower(h.tag)=\"singaporemeeting\") OR (lower(h.tag)=\"kimjongun\") OR (lower(h.tag)=\"donaldtrump\")) return h.tag as Tag, count(h.tag) as OccurenceTags ORDER BY OccurenceTags DESC LIMIT 20'\n",
    "\n",
    "dfImportantPeople= pd.DataFrame(sgraph.data(queryImportantPeople))\n",
    "\n",
    "\n",
    "#Creation du graphique\n",
    "labels = dfImportantPeople['Tag']\n",
    "values = dfImportantPeople['OccurenceTags']\n",
    "colors = ['#eeaba5', '#da4236', '#801b13', '#b2dbc6','#4cab7c','#008744']\n",
    "\n",
    "tracetags = go.Pie(labels=labels, values=values,\n",
    "               hoverinfo='label+percent', textinfo='value',\n",
    "               textfont=dict(size=20),\n",
    "               marker=dict(colors=colors,\n",
    "                           line=dict(color='#000000', width=2)))\n",
    "\n",
    "py.iplot([tracetags], filename='tracetagsstyled_pie_chart')\n",
    "    \n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 29,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<h3 style=\"color:purple;\"> 2) Sentiment Analysis des tweets postés </h3>"
      ],
      "text/plain": [
       "<IPython.core.display.HTML object>"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "%%HTML\n",
    "<h3 style=\"color:purple;\"> 2) Sentiment Analysis des tweets postés </h3>\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 30,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<iframe id=\"igraph\" scrolling=\"no\" style=\"border:none;\" seamless=\"seamless\" src=\"https://plot.ly/~Noiram/12.embed\" height=\"525px\" width=\"100%\"></iframe>"
      ],
      "text/plain": [
       "<plotly.tools.PlotlyDisplay object>"
      ]
     },
     "execution_count": 30,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "queryTweetsPosted=\"MATCH (t:Tweet) return lower(t.text)\" \n",
    "datasent=sgraph.run(queryTweetsPosted)\n",
    "\n",
    "\n",
    "dfPostedTweets = pd.DataFrame(data=[(tweet[0],analize_sentiment(tweet[0])) for tweet in datasent], columns=['Tweets', 'SA'])\n",
    "\n",
    "# We construct lists with classified tweets:\n",
    "\n",
    "slightlypos_tweets = [ tweet for index, tweet in enumerate(dfPostedTweets['Tweets']) if dfPostedTweets['SA'][index] >= 0 and dfPostedTweets['SA'][index] < 3 ]\n",
    "mostlypos_tweets = [ tweet for index, tweet in enumerate(dfPostedTweets['Tweets']) if dfPostedTweets['SA'][index] >= 3 and dfPostedTweets['SA'][index] < 6]\n",
    "complypos_tweets = [ tweet for index, tweet in enumerate(dfPostedTweets['Tweets']) if dfPostedTweets['SA'][index] >= 6]\n",
    "slightlyneg_tweets = [ tweet for index, tweet in enumerate(dfPostedTweets['Tweets']) if dfPostedTweets['SA'][index] < 0 and dfPostedTweets['SA'][index] >= (-3)]\n",
    "mostlyneg_tweets = [ tweet for index, tweet in enumerate(dfPostedTweets['Tweets']) if dfPostedTweets['SA'][index] < (-3) and dfPostedTweets['SA'][index] > (-6)]\n",
    "complyneg_tweets = [ tweet for index, tweet in enumerate(dfPostedTweets['Tweets']) if dfPostedTweets['SA'][index] <=(-6)]\n",
    "\n",
    "\n",
    "#Creation du graphique\n",
    "labels = ['SlightlyNegative', 'MostlyNegative' , 'CompletlyNegative','SlightlyPositive', 'MostlyPositive' , 'CompletlyPositive' ]\n",
    "values = [len(slightlyneg_tweets), len(mostlyneg_tweets), len(complyneg_tweets), len(slightlypos_tweets), len(mostlypos_tweets), len(complypos_tweets)  ]\n",
    "colors = ['#eeaba5', '#da4236', '#801b13', '#b2dbc6','#4cab7c','#008744']\n",
    "\n",
    "traceSA = go.Pie(labels=labels, values=values,\n",
    "               hoverinfo='label+percent', textinfo='value',\n",
    "               textfont=dict(size=20),\n",
    "               marker=dict(colors=colors,\n",
    "                           line=dict(color='#000000', width=2)))\n",
    "\n",
    "py.iplot([traceSA], filename='SATGstyled_pie_chart')\n",
    "    "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 31,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<h3 style=\"color:purple;\" >3) Analyse du nombre d'occurences de mots dans les tweets postés</h3>\n"
      ],
      "text/plain": [
       "<IPython.core.display.HTML object>"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "%%HTML\n",
    "<h3 style=\"color:purple;\" >3) Analyse du nombre d'occurences de mots dans les tweets postés</h3>\n",
    "\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 32,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>mots</th>\n",
       "      <th>occurrence</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>president</td>\n",
       "      <td>2772</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>got</td>\n",
       "      <td>2758</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>gag</td>\n",
       "      <td>2391</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>like</td>\n",
       "      <td>2296</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>great</td>\n",
       "      <td>1994</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>nuclear</td>\n",
       "      <td>1991</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>peace</td>\n",
       "      <td>1900</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>people</td>\n",
       "      <td>1840</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>whats</td>\n",
       "      <td>1821</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>favorite</td>\n",
       "      <td>1671</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10</th>\n",
       "      <td>songradioactivetrumpkimsummit</td>\n",
       "      <td>1649</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11</th>\n",
       "      <td>greqioa</td>\n",
       "      <td>1647</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>12</th>\n",
       "      <td>give</td>\n",
       "      <td>1624</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>13</th>\n",
       "      <td>know</td>\n",
       "      <td>1525</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>14</th>\n",
       "      <td>still</td>\n",
       "      <td>1517</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>15</th>\n",
       "      <td>dressing</td>\n",
       "      <td>1481</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>16</th>\n",
       "      <td>obama</td>\n",
       "      <td>1480</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>17</th>\n",
       "      <td>day</td>\n",
       "      <td>1440</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>18</th>\n",
       "      <td>skin</td>\n",
       "      <td>1430</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>19</th>\n",
       "      <td>zrdikd</td>\n",
       "      <td>1424</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>20</th>\n",
       "      <td>jyoqedx</td>\n",
       "      <td>1424</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>21</th>\n",
       "      <td>one</td>\n",
       "      <td>1415</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>22</th>\n",
       "      <td>women</td>\n",
       "      <td>1402</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>23</th>\n",
       "      <td>forces</td>\n",
       "      <td>1362</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>24</th>\n",
       "      <td>draft</td>\n",
       "      <td>1303</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>25</th>\n",
       "      <td>scooped</td>\n",
       "      <td>1302</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>26</th>\n",
       "      <td>roywoodjr</td>\n",
       "      <td>1299</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>27</th>\n",
       "      <td>world</td>\n",
       "      <td>1281</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>28</th>\n",
       "      <td>johnfugelsang</td>\n",
       "      <td>1262</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>29</th>\n",
       "      <td>cheering</td>\n",
       "      <td>1262</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                             mots  occurrence\n",
       "0                       president        2772\n",
       "1                             got        2758\n",
       "2                             gag        2391\n",
       "3                            like        2296\n",
       "4                           great        1994\n",
       "5                         nuclear        1991\n",
       "6                           peace        1900\n",
       "7                          people        1840\n",
       "8                           whats        1821\n",
       "9                        favorite        1671\n",
       "10  songradioactivetrumpkimsummit        1649\n",
       "11                        greqioa        1647\n",
       "12                           give        1624\n",
       "13                           know        1525\n",
       "14                          still        1517\n",
       "15                       dressing        1481\n",
       "16                          obama        1480\n",
       "17                            day        1440\n",
       "18                           skin        1430\n",
       "19                         zrdikd        1424\n",
       "20                        jyoqedx        1424\n",
       "21                            one        1415\n",
       "22                          women        1402\n",
       "23                         forces        1362\n",
       "24                          draft        1303\n",
       "25                        scooped        1302\n",
       "26                      roywoodjr        1299\n",
       "27                          world        1281\n",
       "28                  johnfugelsang        1262\n",
       "29                       cheering        1262"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "\n",
    "count_all = Counter()\n",
    "\n",
    "for line in dfPostedTweets['Tweets']:\n",
    "    \n",
    "        # Create a list with all the terms\n",
    "    terms_all = [term for term in preprocess(line) if term not in stop]\n",
    "    #terms_all = [term for term in preprocess(line)]\n",
    "        # Update the counter\n",
    "    count_all.update(terms_all)\n",
    "    # Print the first 5 most frequent words\n",
    "\n",
    "\n",
    "data = pd.DataFrame(data=count_all.most_common(30), columns=['mots','occurrence'])\n",
    "display(data)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 33,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<h3 style=\"color:purple;\" >4) Support les plus utilisés pour les tweets collectés</h3>\n",
       "<p>Par choix, nous avons limité les supports aux 10 les plus utilisés</p>"
      ],
      "text/plain": [
       "<IPython.core.display.HTML object>"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "%%HTML\n",
    "<h3 style=\"color:purple;\" >4) Support les plus utilisés pour les tweets collectés</h3>\n",
    "<p>Par choix, nous avons limité les supports aux 10 les plus utilisés</p>"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 34,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<iframe id=\"igraph\" scrolling=\"no\" style=\"border:none;\" seamless=\"seamless\" src=\"https://plot.ly/~Noiram/14.embed\" height=\"525px\" width=\"100%\"></iframe>"
      ],
      "text/plain": [
       "<plotly.tools.PlotlyDisplay object>"
      ]
     },
     "execution_count": 34,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "querysource=\"MATCH (t:Tweet) return t.source, count(t)  ORDER BY count(t) DESC LIMIT 10\"\n",
    "\n",
    "dfsource= pd.DataFrame(sgraph.data(querysource))\n",
    "\n",
    "labels = dfsource['t.source']\n",
    "values = dfsource['count(t)']\n",
    "colors = ['#FEBFB3', '#E1396C', '#96D38C', '#D0F9B1']\n",
    "\n",
    "tracesupp = go.Pie(labels=labels, values=values,\n",
    "               hoverinfo='label+percent', textinfo='value',\n",
    "               textfont=dict(size=20),\n",
    "               marker=dict(colors=colors,\n",
    "                           line=dict(color='#000000', width=2)))\n",
    "\n",
    "py.iplot([tracesupp], filename='suppstyled_pie_chart')\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 35,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<h3 style=\"color:purple;\" >5) Analyse chronologique des nombres de tweets postés</h3>\n"
      ],
      "text/plain": [
       "<IPython.core.display.HTML object>"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "%%HTML\n",
    "<h3 style=\"color:purple;\" >5) Analyse chronologique des nombres de tweets postés</h3>\n",
    "\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 36,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<iframe id=\"igraph\" scrolling=\"no\" style=\"border:none;\" seamless=\"seamless\" src=\"https://plot.ly/~Noiram/16.embed\" height=\"525px\" width=\"100%\"></iframe>"
      ],
      "text/plain": [
       "<plotly.tools.PlotlyDisplay object>"
      ]
     },
     "execution_count": 36,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "querydatetweet=\"MATCH (n:Tweet) RETURN left(n.date,16) as datetweet , count(*) order by datetweet\"\n",
    "\n",
    "dfdatetweet= pd.DataFrame(sgraph.data(querydatetweet))\n",
    "\n",
    "trace = go.Scatter(x=dfdatetweet[\"datetweet\"],\n",
    "                   y=dfdatetweet['count(*)'])\n",
    "\n",
    "data = [trace]\n",
    "layout = dict(\n",
    "    title='Nombre de Tweets postés chronologiquement (UTC Time)',\n",
    "    xaxis=dict(\n",
    "        rangeselector=dict(\n",
    "            buttons=list([\n",
    "                dict(count=1,\n",
    "                     label='1 mois',\n",
    "                     step='month',\n",
    "                     stepmode='backward'),\n",
    "                dict(count=6,\n",
    "                     label='6 mois',\n",
    "                     step='month',\n",
    "                     stepmode='backward'),\n",
    "                dict(count=1,\n",
    "                    label='Janvier -> Aujourd\"hui',\n",
    "                    step='year',\n",
    "                    stepmode='todate'),\n",
    "                dict(count=1,\n",
    "                    label='1 an',\n",
    "                    step='year',\n",
    "                    stepmode='backward'),\n",
    "                dict(step='all')\n",
    "            ])\n",
    "        ),\n",
    "        rangeslider=dict(),\n",
    "        type='date'\n",
    "    )\n",
    ")\n",
    "\n",
    "fig = dict(data=data, layout=layout)\n",
    "py.iplot(fig)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 37,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<h1>Analyse des Tweets les plus influents<h1>\n",
       "<h2>1) Analyse des tweets des personnes ayant le plus de followers</h2>\n",
       "<h3 style=\"color:purple;\"> 1.A) Analyse des Tags utilisés par les Users des tweets collectés ayant le plus de followers</h3>\n",
       "<p>Par choix, nous avons limité l'analyse au nombre de 20 users et avons supprimé les tags suivants:</p>\n",
       "    <UL>\n",
       "        <LI>Trump</LI>\n",
       "        <LI>TrumpKim</LI>\n",
       "        <LI>TrumpKimSummit</LI>\n",
       "        <LI>TrumpKimMeeting</LI>\n",
       "        <LI>SingaporeSummit</LI>\n",
       "        <LI>SingaporeMeeting</LI>\n",
       "        <LI>Trump</LI>\n",
       "        <LI>kimjongun</LI>\n",
       "        <LI>DonaldTrump</LI>\n",
       "        <LI>Kim</LI>\n",
       "        <LI>Summit</LI>\n",
       "    </UL>"
      ],
      "text/plain": [
       "<IPython.core.display.HTML object>"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "%%HTML\n",
    "<h1>Analyse des Tweets les plus influents<h1>\n",
    "<h2>1) Analyse des tweets des personnes ayant le plus de followers</h2>\n",
    "<h3 style=\"color:purple;\"> 1.A) Analyse des Tags utilisés par les Users des tweets collectés ayant le plus de followers</h3>\n",
    "<p>Par choix, nous avons limité l'analyse au nombre de 20 users et avons supprimé les tags suivants:</p>\n",
    "    <UL>\n",
    "        <LI>Trump</LI>\n",
    "        <LI>TrumpKim</LI>\n",
    "        <LI>TrumpKimSummit</LI>\n",
    "        <LI>TrumpKimMeeting</LI>\n",
    "        <LI>SingaporeSummit</LI>\n",
    "        <LI>SingaporeMeeting</LI>\n",
    "        <LI>Trump</LI>\n",
    "        <LI>kimjongun</LI>\n",
    "        <LI>DonaldTrump</LI>\n",
    "        <LI>Kim</LI>\n",
    "        <LI>Summit</LI>\n",
    "    </UL>"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 38,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>ListeTags</th>\n",
       "      <th>UserFollowersCount</th>\n",
       "      <th>UserScreenName</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>[Backstory]</td>\n",
       "      <td>19799694</td>\n",
       "      <td>Reuters</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>[Singapore, NorthKorea, China, SouthKorea, Pom...</td>\n",
       "      <td>1013526</td>\n",
       "      <td>STcom</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>[CNN]</td>\n",
       "      <td>986341</td>\n",
       "      <td>geoffdeweaver</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>[WhatsOnYourCan, WhatsOnYourCup, MofayaBranded...</td>\n",
       "      <td>722064</td>\n",
       "      <td>djsbu</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>[Rodman]</td>\n",
       "      <td>688294</td>\n",
       "      <td>SABreakingNews</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>[, Singaporean]</td>\n",
       "      <td>597481</td>\n",
       "      <td>globaltimesnews</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>[Backstory]</td>\n",
       "      <td>577791</td>\n",
       "      <td>ReutersChina</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>[China, Pakistan, India]</td>\n",
       "      <td>466851</td>\n",
       "      <td>FinancialXpress</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>[NorthKorea, denuclearization, US, Sanctions, ...</td>\n",
       "      <td>425608</td>\n",
       "      <td>Fnewsenglish</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>[WednesdayWisdom, RETWEET, BuildThatWall]</td>\n",
       "      <td>317562</td>\n",
       "      <td>WeSupport45</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10</th>\n",
       "      <td>[hannity]</td>\n",
       "      <td>275085</td>\n",
       "      <td>AhhPhotography</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11</th>\n",
       "      <td>[tictocnews]</td>\n",
       "      <td>271729</td>\n",
       "      <td>tictoc</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>12</th>\n",
       "      <td>[IDWP]</td>\n",
       "      <td>261019</td>\n",
       "      <td>idclrWorldPeace</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>13</th>\n",
       "      <td>[NorthKorea, India, SouthKorea, TrumpIsm]</td>\n",
       "      <td>249441</td>\n",
       "      <td>harishbijoor</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>14</th>\n",
       "      <td>[singapore]</td>\n",
       "      <td>187846</td>\n",
       "      <td>France24en</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>15</th>\n",
       "      <td>[Yemen, GrenfellTower]</td>\n",
       "      <td>166434</td>\n",
       "      <td>klustout</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>16</th>\n",
       "      <td>[GoodlatteBill]</td>\n",
       "      <td>165296</td>\n",
       "      <td>WashingtonDCTea</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>17</th>\n",
       "      <td>[FakeNews]</td>\n",
       "      <td>157620</td>\n",
       "      <td>drdot</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>18</th>\n",
       "      <td>[US]</td>\n",
       "      <td>157409</td>\n",
       "      <td>arabnews</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>19</th>\n",
       "      <td>[DNC, Rodman]</td>\n",
       "      <td>145919</td>\n",
       "      <td>sxdoc</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                                            ListeTags UserFollowersCount  \\\n",
       "0                                         [Backstory]           19799694   \n",
       "1   [Singapore, NorthKorea, China, SouthKorea, Pom...            1013526   \n",
       "2                                               [CNN]             986341   \n",
       "3   [WhatsOnYourCan, WhatsOnYourCup, MofayaBranded...             722064   \n",
       "4                                            [Rodman]             688294   \n",
       "5                                     [, Singaporean]             597481   \n",
       "6                                         [Backstory]             577791   \n",
       "7                            [China, Pakistan, India]             466851   \n",
       "8   [NorthKorea, denuclearization, US, Sanctions, ...             425608   \n",
       "9           [WednesdayWisdom, RETWEET, BuildThatWall]             317562   \n",
       "10                                          [hannity]             275085   \n",
       "11                                       [tictocnews]             271729   \n",
       "12                                             [IDWP]             261019   \n",
       "13          [NorthKorea, India, SouthKorea, TrumpIsm]             249441   \n",
       "14                                        [singapore]             187846   \n",
       "15                             [Yemen, GrenfellTower]             166434   \n",
       "16                                    [GoodlatteBill]             165296   \n",
       "17                                         [FakeNews]             157620   \n",
       "18                                               [US]             157409   \n",
       "19                                      [DNC, Rodman]             145919   \n",
       "\n",
       "     UserScreenName  \n",
       "0           Reuters  \n",
       "1             STcom  \n",
       "2     geoffdeweaver  \n",
       "3             djsbu  \n",
       "4    SABreakingNews  \n",
       "5   globaltimesnews  \n",
       "6      ReutersChina  \n",
       "7   FinancialXpress  \n",
       "8      Fnewsenglish  \n",
       "9       WeSupport45  \n",
       "10   AhhPhotography  \n",
       "11           tictoc  \n",
       "12  idclrWorldPeace  \n",
       "13     harishbijoor  \n",
       "14       France24en  \n",
       "15         klustout  \n",
       "16  WashingtonDCTea  \n",
       "17            drdot  \n",
       "18         arabnews  \n",
       "19            sxdoc  "
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "queryImportantPeople='MATCH (u:User)-[r:Posted]->(t:Tweet)-[re:HAS]->(h:Hashtag) WHERE NOT ((lower(h.tag) = \"trump\") OR (lower(h.tag)=\"trumpkim\") OR (lower(h.tag)=\"trumpkimsummit\") OR (lower(h.tag)=\"kim\") OR (lower(h.tag)=\"trumpkimmeeting\") OR (lower(h.tag)=\"singaporesummit\") OR (lower(h.tag)=\"singaporemeeting\") OR (lower(h.tag)=\"kimjongun\") OR (lower(h.tag)=\"donaldtrump\")) return u.screen_name as UserScreenName,u.followers_count as UserFollowersCount,collect(DISTINCT h.tag) as ListeTags ORDER BY toInt(u.followers_count) DESC LIMIT 20'\n",
    "\n",
    "dfImportantPeople= pd.DataFrame(sgraph.data(queryImportantPeople))\n",
    "display(dfImportantPeople)\n",
    "\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 39,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<h3 style=\"color:purple;\"> 1.B) Sentiment analysis des tweets postés par les Users ayant le plus de followers</h3>"
      ],
      "text/plain": [
       "<IPython.core.display.HTML object>"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "%%HTML\n",
    "<h3 style=\"color:purple;\"> 1.B) Sentiment analysis des tweets postés par les Users ayant le plus de followers</h3>"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 40,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<iframe id=\"igraph\" scrolling=\"no\" style=\"border:none;\" seamless=\"seamless\" src=\"https://plot.ly/~Noiram/18.embed\" height=\"525px\" width=\"100%\"></iframe>"
      ],
      "text/plain": [
       "<plotly.tools.PlotlyDisplay object>"
      ]
     },
     "execution_count": 40,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "queryImportantPeopleTweets=\"MATCH (u:User)-[r:Posted]->(t:Tweet) WHERE toInt(u.followers_count)>10000 return lower(t.text)\" \n",
    "datasent=sgraph.run(queryImportantPeopleTweets)\n",
    "\n",
    "\n",
    "dfImportantTweets = pd.DataFrame(data=[(tweet[0],analize_sentiment(tweet[0])) for tweet in datasent], columns=['Tweets', 'SA'])\n",
    "\n",
    "# We construct lists with classified tweets:\n",
    "\n",
    "slightlypos_tweets = [ tweet for index, tweet in enumerate(dfImportantTweets['Tweets']) if dfImportantTweets['SA'][index] >= 0 and dfImportantTweets['SA'][index] < 3 ]\n",
    "mostlypos_tweets = [ tweet for index, tweet in enumerate(dfImportantTweets['Tweets']) if dfImportantTweets['SA'][index] >= 3 and dfImportantTweets['SA'][index] < 6]\n",
    "complypos_tweets = [ tweet for index, tweet in enumerate(dfImportantTweets['Tweets']) if dfImportantTweets['SA'][index] >= 6]\n",
    "slightlyneg_tweets = [ tweet for index, tweet in enumerate(dfImportantTweets['Tweets']) if dfImportantTweets['SA'][index] < 0 and dfImportantTweets['SA'][index] >= (-3)]\n",
    "mostlyneg_tweets = [ tweet for index, tweet in enumerate(dfImportantTweets['Tweets']) if dfImportantTweets['SA'][index] < (-3) and dfImportantTweets['SA'][index] > (-6)]\n",
    "complyneg_tweets = [ tweet for index, tweet in enumerate(dfImportantTweets['Tweets']) if dfImportantTweets['SA'][index] <=(-6)]\n",
    "\n",
    "\n",
    "#Creation du graphique\n",
    "labels = ['SlightlyNegative', 'MostlyNegative' , 'CompletlyNegative','SlightlyPositive', 'MostlyPositive' , 'CompletlyPositive' ]\n",
    "values = [len(slightlyneg_tweets), len(mostlyneg_tweets), len(complyneg_tweets), len(slightlypos_tweets), len(mostlypos_tweets), len(complypos_tweets)  ]\n",
    "colors = ['#eeaba5', '#da4236', '#801b13', '#b2dbc6','#4cab7c','#008744']\n",
    "\n",
    "traceSAIT = go.Pie(labels=labels, values=values,\n",
    "               hoverinfo='label+percent', textinfo='value',\n",
    "               textfont=dict(size=20),\n",
    "               marker=dict(colors=colors,\n",
    "                           line=dict(color='#000000', width=2)))\n",
    "\n",
    "py.iplot([traceSAIT], filename='SAITstyled_pie_chart')\n",
    "    \n",
    "    "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 41,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<h3 style=\"color:purple;\"> 1.C) Analyse du nombre d'occurences de mots dans les tweets postés</h3>"
      ],
      "text/plain": [
       "<IPython.core.display.HTML object>"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "%%HTML\n",
    "<h3 style=\"color:purple;\"> 1.C) Analyse du nombre d'occurences de mots dans les tweets postés</h3>"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 42,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>mots</th>\n",
       "      <th>occurrence</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>president</td>\n",
       "      <td>243</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>would</td>\n",
       "      <td>205</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>peace</td>\n",
       "      <td>186</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>obama</td>\n",
       "      <td>158</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>potus</td>\n",
       "      <td>151</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>days</td>\n",
       "      <td>146</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>one</td>\n",
       "      <td>139</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>cnn</td>\n",
       "      <td>124</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>like</td>\n",
       "      <td>121</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>historic</td>\n",
       "      <td>112</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10</th>\n",
       "      <td>world</td>\n",
       "      <td>108</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11</th>\n",
       "      <td>know</td>\n",
       "      <td>108</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>12</th>\n",
       "      <td>great</td>\n",
       "      <td>107</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>13</th>\n",
       "      <td>even</td>\n",
       "      <td>102</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>14</th>\n",
       "      <td>beckystidepods</td>\n",
       "      <td>102</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>15</th>\n",
       "      <td>iwillredpillu</td>\n",
       "      <td>98</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>16</th>\n",
       "      <td>im</td>\n",
       "      <td>97</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>17</th>\n",
       "      <td>thank</td>\n",
       "      <td>95</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>18</th>\n",
       "      <td>back</td>\n",
       "      <td>95</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>19</th>\n",
       "      <td>got</td>\n",
       "      <td>95</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>20</th>\n",
       "      <td>liberals</td>\n",
       "      <td>95</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>21</th>\n",
       "      <td>time</td>\n",
       "      <td>91</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>22</th>\n",
       "      <td>man</td>\n",
       "      <td>90</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>23</th>\n",
       "      <td>air</td>\n",
       "      <td>89</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>24</th>\n",
       "      <td>fake</td>\n",
       "      <td>85</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>25</th>\n",
       "      <td>people</td>\n",
       "      <td>85</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>26</th>\n",
       "      <td>think</td>\n",
       "      <td>80</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>27</th>\n",
       "      <td>couldnt</td>\n",
       "      <td>77</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>28</th>\n",
       "      <td>miles</td>\n",
       "      <td>76</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>29</th>\n",
       "      <td>hours</td>\n",
       "      <td>75</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "              mots  occurrence\n",
       "0        president         243\n",
       "1            would         205\n",
       "2            peace         186\n",
       "3            obama         158\n",
       "4            potus         151\n",
       "5             days         146\n",
       "6              one         139\n",
       "7              cnn         124\n",
       "8             like         121\n",
       "9         historic         112\n",
       "10           world         108\n",
       "11            know         108\n",
       "12           great         107\n",
       "13            even         102\n",
       "14  beckystidepods         102\n",
       "15   iwillredpillu          98\n",
       "16              im          97\n",
       "17           thank          95\n",
       "18            back          95\n",
       "19             got          95\n",
       "20        liberals          95\n",
       "21            time          91\n",
       "22             man          90\n",
       "23             air          89\n",
       "24            fake          85\n",
       "25          people          85\n",
       "26           think          80\n",
       "27         couldnt          77\n",
       "28           miles          76\n",
       "29           hours          75"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "count_all = Counter()\n",
    "\n",
    "for line in dfImportantTweets['Tweets']:\n",
    "    \n",
    "        # Create a list with all the terms\n",
    "    terms_all = [term for term in preprocess(line) if term not in stop]\n",
    "    #terms_all = [term for term in preprocess(line)]\n",
    "        # Update the counter\n",
    "    count_all.update(terms_all)\n",
    "    # Print the first 5 most frequent words\n",
    "\n",
    "\n",
    "data = pd.DataFrame(data=count_all.most_common(30), columns=['mots','occurrence'])\n",
    "display(data)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 43,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<h1>Analyse des Tweets les plus influents<h1>\n",
       "<h2>2) Analyse des tweets postés par les médias</h2>\n",
       "<h3 style=\"color:purple;\">2.A)Analyse des Tags utilisés par les Médias</h3>\n",
       "<p>Par choix, nous avons limité l'analyse au nombre de 20 users et avons supprimé les tags suivants:</p>\n",
       "    <UL>\n",
       "        <LI>Trump</LI>\n",
       "        <LI>TrumpKim</LI>\n",
       "        <LI>TrumpKimSummit</LI>\n",
       "        <LI>TrumpKimMeeting</LI>\n",
       "        <LI>SingaporeSummit</LI>\n",
       "        <LI>SingaporeMeeting</LI>\n",
       "        <LI>Trump</LI>\n",
       "        <LI>kimjongun</LI>\n",
       "        <LI>DonaldTrump</LI>\n",
       "        <LI>Kim</LI>\n",
       "        <LI>Summit</LI>\n",
       "    </UL>"
      ],
      "text/plain": [
       "<IPython.core.display.HTML object>"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "%%HTML\n",
    "<h1>Analyse des Tweets les plus influents<h1>\n",
    "<h2>2) Analyse des tweets postés par les médias</h2>\n",
    "<h3 style=\"color:purple;\">2.A)Analyse des Tags utilisés par les Médias</h3>\n",
    "<p>Par choix, nous avons limité l'analyse au nombre de 20 users et avons supprimé les tags suivants:</p>\n",
    "    <UL>\n",
    "        <LI>Trump</LI>\n",
    "        <LI>TrumpKim</LI>\n",
    "        <LI>TrumpKimSummit</LI>\n",
    "        <LI>TrumpKimMeeting</LI>\n",
    "        <LI>SingaporeSummit</LI>\n",
    "        <LI>SingaporeMeeting</LI>\n",
    "        <LI>Trump</LI>\n",
    "        <LI>kimjongun</LI>\n",
    "        <LI>DonaldTrump</LI>\n",
    "        <LI>Kim</LI>\n",
    "        <LI>Summit</LI>\n",
    "    </UL>"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 44,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>ListeTags</th>\n",
       "      <th>UserFollowersCount</th>\n",
       "      <th>UserScreenName</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>[Rodman]</td>\n",
       "      <td>688294</td>\n",
       "      <td>SABreakingNews</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>[, Singaporean]</td>\n",
       "      <td>597481</td>\n",
       "      <td>globaltimesnews</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>[NorthKorea, denuclearization, US, Sanctions, ...</td>\n",
       "      <td>425608</td>\n",
       "      <td>Fnewsenglish</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>[US]</td>\n",
       "      <td>157409</td>\n",
       "      <td>arabnews</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>[tariffs]</td>\n",
       "      <td>112640</td>\n",
       "      <td>newschannelnine</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>[NorthKorea, Nuclearthreat]</td>\n",
       "      <td>95020</td>\n",
       "      <td>newsonepk</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>[NorthKorea]</td>\n",
       "      <td>86352</td>\n",
       "      <td>CBNNews</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>[morintoon]</td>\n",
       "      <td>62921</td>\n",
       "      <td>DannyShookNews</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>[worldcup, FFRNN, BRAINWASHER]</td>\n",
       "      <td>50718</td>\n",
       "      <td>FFRNewsNet1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>[Russia]</td>\n",
       "      <td>41874</td>\n",
       "      <td>JuliaDavisNews</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10</th>\n",
       "      <td>[NorthKorea]</td>\n",
       "      <td>30457</td>\n",
       "      <td>foxnewspoll</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11</th>\n",
       "      <td>[Hannity]</td>\n",
       "      <td>21317</td>\n",
       "      <td>IsraelNewsLinks</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>12</th>\n",
       "      <td>[MatterOfFact]</td>\n",
       "      <td>19557</td>\n",
       "      <td>JezNews</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>13</th>\n",
       "      <td>[Turnbull]</td>\n",
       "      <td>14438</td>\n",
       "      <td>WashNewsLine</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>14</th>\n",
       "      <td>[NorthKorea, Resistance, singapore, MuellerTime]</td>\n",
       "      <td>8989</td>\n",
       "      <td>TheFlakeNews</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>15</th>\n",
       "      <td>[Obama]</td>\n",
       "      <td>8307</td>\n",
       "      <td>1776RealNews</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>16</th>\n",
       "      <td>[Singapore]</td>\n",
       "      <td>6262</td>\n",
       "      <td>CordeliaSkyNews</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>17</th>\n",
       "      <td>[Taiwan, TsaiIngWen]</td>\n",
       "      <td>5885</td>\n",
       "      <td>TaiwanNews886</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>18</th>\n",
       "      <td>[MPRraccoon]</td>\n",
       "      <td>5550</td>\n",
       "      <td>davlinnews</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>19</th>\n",
       "      <td>[maddow, inners]</td>\n",
       "      <td>5231</td>\n",
       "      <td>BarbaraLNewsome</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                                            ListeTags UserFollowersCount  \\\n",
       "0                                            [Rodman]             688294   \n",
       "1                                     [, Singaporean]             597481   \n",
       "2   [NorthKorea, denuclearization, US, Sanctions, ...             425608   \n",
       "3                                                [US]             157409   \n",
       "4                                           [tariffs]             112640   \n",
       "5                         [NorthKorea, Nuclearthreat]              95020   \n",
       "6                                        [NorthKorea]              86352   \n",
       "7                                         [morintoon]              62921   \n",
       "8                      [worldcup, FFRNN, BRAINWASHER]              50718   \n",
       "9                                            [Russia]              41874   \n",
       "10                                       [NorthKorea]              30457   \n",
       "11                                          [Hannity]              21317   \n",
       "12                                     [MatterOfFact]              19557   \n",
       "13                                         [Turnbull]              14438   \n",
       "14   [NorthKorea, Resistance, singapore, MuellerTime]               8989   \n",
       "15                                            [Obama]               8307   \n",
       "16                                        [Singapore]               6262   \n",
       "17                               [Taiwan, TsaiIngWen]               5885   \n",
       "18                                       [MPRraccoon]               5550   \n",
       "19                                   [maddow, inners]               5231   \n",
       "\n",
       "     UserScreenName  \n",
       "0    SABreakingNews  \n",
       "1   globaltimesnews  \n",
       "2      Fnewsenglish  \n",
       "3          arabnews  \n",
       "4   newschannelnine  \n",
       "5         newsonepk  \n",
       "6           CBNNews  \n",
       "7    DannyShookNews  \n",
       "8       FFRNewsNet1  \n",
       "9    JuliaDavisNews  \n",
       "10      foxnewspoll  \n",
       "11  IsraelNewsLinks  \n",
       "12          JezNews  \n",
       "13     WashNewsLine  \n",
       "14     TheFlakeNews  \n",
       "15     1776RealNews  \n",
       "16  CordeliaSkyNews  \n",
       "17    TaiwanNews886  \n",
       "18       davlinnews  \n",
       "19  BarbaraLNewsome  "
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "queryMedias='MATCH (u:User)-[r:Posted]->(t:Tweet)-[re:HAS]->(h:Hashtag) WHERE lower(u.screen_name) CONTAINS \"news\" AND NOT ((lower(h.tag) = \"trump\") OR (lower(h.tag)=\"trumpkim\") OR (lower(h.tag)=\"trumpkimsummit\") OR (lower(h.tag)=\"kim\") OR (lower(h.tag)=\"trumpkimmeeting\") OR (lower(h.tag)=\"singaporesummit\") OR (lower(h.tag)=\"singaporemeeting\") OR (lower(h.tag)=\"kimjongun\") OR (lower(h.tag)=\"donaldtrump\")) return u.screen_name as UserScreenName,u.followers_count as UserFollowersCount,collect(DISTINCT h.tag) as ListeTags ORDER BY toInt(u.followers_count) DESC LIMIT 20'\n",
    "\n",
    "dfMedias= pd.DataFrame(sgraph.data(queryMedias))\n",
    "display(dfMedias)\n",
    "\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 45,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<h3 style=\"color:purple;\">2.B) Sentimental Analysis des tweets postés par les Médias</h3>"
      ],
      "text/plain": [
       "<IPython.core.display.HTML object>"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "%%HTML\n",
    "<h3 style=\"color:purple;\">2.B) Sentimental Analysis des tweets postés par les Médias</h3>\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 47,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<iframe id=\"igraph\" scrolling=\"no\" style=\"border:none;\" seamless=\"seamless\" src=\"https://plot.ly/~Noiram/20.embed\" height=\"525px\" width=\"100%\"></iframe>"
      ],
      "text/plain": [
       "<plotly.tools.PlotlyDisplay object>"
      ]
     },
     "execution_count": 47,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "\n",
    "queryMediasTweets='MATCH (u:User)-[r:Posted]->(t:Tweet) WHERE lower(u.screen_name) CONTAINS \"news\" return lower(t.text)' \n",
    "datasent=sgraph.run(queryMediasTweets)\n",
    "\n",
    "\n",
    "dfMediasTweets = pd.DataFrame(data=[(tweet[0],analize_sentiment(tweet[0])) for tweet in datasent], columns=['Tweets', 'SA'])\n",
    "\n",
    "# We construct lists with classified tweets:\n",
    "\n",
    "slightlypos_tweets = [ tweet for index, tweet in enumerate(dfMediasTweets['Tweets']) if dfMediasTweets['SA'][index] >= 0 and dfMediasTweets['SA'][index] < 3 ]\n",
    "mostlypos_tweets = [ tweet for index, tweet in enumerate(dfMediasTweets['Tweets']) if dfMediasTweets['SA'][index] >= 3 and dfMediasTweets['SA'][index] < 6]\n",
    "complypos_tweets = [ tweet for index, tweet in enumerate(dfMediasTweets['Tweets']) if dfMediasTweets['SA'][index] >= 6]\n",
    "slightlyneg_tweets = [ tweet for index, tweet in enumerate(dfMediasTweets['Tweets']) if dfMediasTweets['SA'][index] < 0 and dfMediasTweets['SA'][index] >= (-3)]\n",
    "mostlyneg_tweets = [ tweet for index, tweet in enumerate(dfMediasTweets['Tweets']) if dfMediasTweets['SA'][index] < (-3) and dfMediasTweets['SA'][index] > (-6)]\n",
    "complyneg_tweets = [ tweet for index, tweet in enumerate(dfMediasTweets['Tweets']) if dfMediasTweets['SA'][index] <=(-6)]\n",
    "\n",
    "\n",
    "#Creation du graphique\n",
    "labels = ['SlightlyNegative', 'MostlyNegative' , 'CompletlyNegative','SlightlyPositive', 'MostlyPositive' , 'CompletlyPositive' ]\n",
    "values = [len(slightlyneg_tweets), len(mostlyneg_tweets), len(complyneg_tweets), len(slightlypos_tweets), len(mostlypos_tweets), len(complypos_tweets)  ]\n",
    "colors = ['#eeaba5', '#da4236', '#801b13', '#b2dbc6','#4cab7c','#008744']\n",
    "\n",
    "traceSAM = go.Pie(labels=labels, values=values,\n",
    "               hoverinfo='label+percent', textinfo='value',\n",
    "               textfont=dict(size=20),\n",
    "               marker=dict(colors=colors,\n",
    "                           line=dict(color='#000000', width=2)))\n",
    "\n",
    "py.iplot([traceSAM], filename='SAMstyled_pie_chart')\n",
    "    \n",
    "    "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 48,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<h3 style=\"color:purple;\">2.C) Analyse du nombre d'occurences de mots des tweets postés par les Médias</h3>"
      ],
      "text/plain": [
       "<IPython.core.display.HTML object>"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "%%HTML\n",
    "<h3 style=\"color:purple;\">2.C) Analyse du nombre d'occurences de mots des tweets postés par les Médias</h3>\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 49,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>mots</th>\n",
       "      <th>occurrence</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>says</td>\n",
       "      <td>13</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>news</td>\n",
       "      <td>12</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>president</td>\n",
       "      <td>11</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>historic</td>\n",
       "      <td>10</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>great</td>\n",
       "      <td>8</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>watch</td>\n",
       "      <td>7</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>time</td>\n",
       "      <td>7</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>latest</td>\n",
       "      <td>7</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>new</td>\n",
       "      <td>7</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>tictoc</td>\n",
       "      <td>7</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10</th>\n",
       "      <td>nuclear</td>\n",
       "      <td>7</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11</th>\n",
       "      <td>war</td>\n",
       "      <td>7</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>12</th>\n",
       "      <td>give</td>\n",
       "      <td>6</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>13</th>\n",
       "      <td>state</td>\n",
       "      <td>6</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>14</th>\n",
       "      <td>reuters</td>\n",
       "      <td>6</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>15</th>\n",
       "      <td>world</td>\n",
       "      <td>6</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>16</th>\n",
       "      <td>china</td>\n",
       "      <td>6</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>17</th>\n",
       "      <td>got</td>\n",
       "      <td>5</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>18</th>\n",
       "      <td>speech</td>\n",
       "      <td>5</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>19</th>\n",
       "      <td>con</td>\n",
       "      <td>5</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>20</th>\n",
       "      <td>beginning</td>\n",
       "      <td>5</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>21</th>\n",
       "      <td>half</td>\n",
       "      <td>5</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>22</th>\n",
       "      <td>done</td>\n",
       "      <td>5</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>23</th>\n",
       "      <td>important</td>\n",
       "      <td>5</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>24</th>\n",
       "      <td>foxnews</td>\n",
       "      <td>5</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>25</th>\n",
       "      <td>obama</td>\n",
       "      <td>4</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>26</th>\n",
       "      <td>uns</td>\n",
       "      <td>4</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>27</th>\n",
       "      <td>tv</td>\n",
       "      <td>4</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>28</th>\n",
       "      <td>south</td>\n",
       "      <td>4</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>29</th>\n",
       "      <td>denuclearization</td>\n",
       "      <td>4</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                mots  occurrence\n",
       "0               says          13\n",
       "1               news          12\n",
       "2          president          11\n",
       "3           historic          10\n",
       "4              great           8\n",
       "5              watch           7\n",
       "6               time           7\n",
       "7             latest           7\n",
       "8                new           7\n",
       "9             tictoc           7\n",
       "10           nuclear           7\n",
       "11               war           7\n",
       "12              give           6\n",
       "13             state           6\n",
       "14           reuters           6\n",
       "15             world           6\n",
       "16             china           6\n",
       "17               got           5\n",
       "18            speech           5\n",
       "19               con           5\n",
       "20         beginning           5\n",
       "21              half           5\n",
       "22              done           5\n",
       "23         important           5\n",
       "24           foxnews           5\n",
       "25             obama           4\n",
       "26               uns           4\n",
       "27                tv           4\n",
       "28             south           4\n",
       "29  denuclearization           4"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "count_all = Counter()\n",
    "\n",
    "for line in dfMediasTweets['Tweets']:\n",
    "    \n",
    "        # Create a list with all the terms\n",
    "    terms_all = [term for term in preprocess(line) if term not in stop]\n",
    "    #terms_all = [term for term in preprocess(line)]\n",
    "        # Update the counter\n",
    "    count_all.update(terms_all)\n",
    "    # Print the first 5 most frequent words\n",
    "\n",
    "\n",
    "data = pd.DataFrame(data=count_all.most_common(30), columns=['mots','occurrence'])\n",
    "display(data)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.6.4"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
